[Weapon.WeaponType_TurretShared WeaponTypeDefinition]
Typename="Semi-automatic sniper rifle"
PickupMessage="you have %s"
UseFailureLevelMessage="You must be at least level %d to use this feature.."
UseFailureConstraintsMessage="This product is not available."
NoManufacturerName="a lot"

